{
    "genuses": [
        {
            "name": "Carex",
            "occurenceTotalGenus": 5,
            "subgenena": [
                {
                    "name": "Carex arctata",
                    "occurrences": 65,
                    "imgUrl": "http://data.huh.harvard.edu/168d4329-1133-4a0e-b6d3-28133db6526f/image",
                    "description": "Carex arctata, commonly known as **slender sedge**, is a perennial herbaceous plant belonging to the Cyperaceae family (sedge family).  It's a relatively common species found across a wide range of habitats in North America, from Alaska and Canada south to the Appalachian Mountains and the western United States.\n\n**Basic Features:**\n\n* **Growth Habit:** Slender sedge grows in dense clumps, typically reaching heights of 10-60 cm (4-24 inches).\n* **Leaves:** Its leaves are narrow, flat to slightly folded, and usually 2-5 mm wide,  with a rough texture. They are typically shorter than the stems.\n* **Inflorescence:** The inflorescence is composed of several slender, spike-like clusters (spikes) arranged in a loose, open arrangement. The female spikes are usually distinct from the male spikes.\n* **Fruit:** The fruits are achenes (small, dry, one-seeded fruits) enclosed within a sac-like structure called a perigynium.  These perigynia are distinctive in *Carex arctata*, being relatively slender and long-beaked.\n* **Roots:** It develops a fibrous root system.\n\n**Historic Usage:**\n\nWhile *Carex arctata* hasn't seen widespread commercial or medicinal use historically, like some other sedge species, it has played a role in several ways for Indigenous peoples across its range:\n\n* **Weaving/Matting:**  The tough leaves of many sedges, including likely *Carex arctata* in suitable regions, have been used for weaving mats, baskets, and other utilitarian items.  The specific use of this species would vary depending on the region and the availability of other suitable plant materials.\n* **Thatching:** Similar to weaving, the strong stalks might have been used for thatching roofs in some areas.\n* **Emergency Food Source:** Although not a primary food source, the roots or young shoots of some sedge species might have provided supplementary food in times of scarcity. This is not well-documented for *Carex arctata* specifically, but is a possibility considering the practices of other Indigenous cultures.\n\nIt is vital to note that historical uses should not be interpreted as recommendations for current practices without extensive research and appropriate guidance from experts on ethnobotany and plant identification. Many sedges look similar, and improper identification could lead to the consumption of toxic plants.\n"
                },
                {
                    "name": "Carex communis",
                    "occurrences": 28,
                    "imgUrl": "http://data.huh.harvard.edu/6b398504-75a9-42a2-ae9c-fed0d0249408/image",
                    "description": "Carex communis, commonly known as common sedge, is a species of flowering plant in the sedge family, Cyperaceae.  It's a widespread and adaptable grass-like plant found throughout much of Europe and parts of Asia, thriving in a variety of habitats ranging from moist meadows and pastures to woodlands and even roadside verges.\n\n**Basic Features:**\n\n* **Appearance:**  Carex communis is a perennial herb with slender, wiry stems typically growing to heights of 20-60 cm (8-24 inches). Its leaves are linear, flat, and relatively rough to the touch, usually greyish-green in colour. The inflorescence (flower cluster) is a characteristic feature of sedges, consisting of numerous small, spikelets arranged in a somewhat loose, elongated structure. The spikelets are unisexual, meaning some bear only male flowers (staminate) and others only female flowers (pistillate), often arranged differently along the stem. The fruit is an achene (a dry, one-seeded fruit).\n\n* **Growth Habit:**  It spreads through rhizomes (underground stems), forming dense tufts or clumps.  This makes it relatively hardy and capable of colonising areas effectively.\n\n**Historic Usage:**\n\nHistorically, Carex communis, like other sedges, has seen limited direct human use compared to major cereal crops or fiber plants.  Its main role has been ecological rather than economically significant:\n\n* **Thatching:**  In some regions and historical periods, the tough leaves might have been used in rudimentary thatching for roofs or as a component in weaving simple mats or baskets, though this wasn't a widespread practice compared to other plant species better suited for such purposes.\n\n* **Pasture/Forage:** While not a preferred forage plant, livestock may graze on it, particularly when other food sources are scarce. Its nutritional value is relatively low compared to cultivated grasses.\n\n* **Erosion Control:** Its rhizomatous nature and ability to colonize various soils make it useful in some ecological restoration projects aimed at stabilising soil and preventing erosion, a function increasingly appreciated in modern times.\n\n\nIn summary, Carex communis is a common and unassuming plant with a mostly ecological role throughout history. While not a major crop or widely utilized for human purposes, its presence is indicative of various habitat types and its role in soil stabilization is becoming more recognised.\n"
                },
                {
                    "name": "Carex stricta",
                    "occurrences": 95,
                    "imgUrl": "http://data.huh.harvard.edu/9ce50706-b5dd-4296-802b-e8b47d1bd41e/image",
                    "description": "Carex stricta, commonly known as **stiff sedge**, is a perennial herbaceous plant belonging to the sedge family, Cyperaceae.  It's a native species to much of North America, found in a wide range of wet habitats including marshes, swamps, lake shores, and stream banks.\n\n**Basic Features:**\n\n* **Growth Habit:**  Stiff sedge forms dense, clumping tussocks.  It grows upright, reaching heights of 30-100 cm (12-39 inches).\n* **Leaves:**  The leaves are long, narrow, and stiff (hence the common name), typically 3-10 mm wide, and have a rough texture along the margins. They are mostly basal, meaning they emerge from the base of the plant.\n* **Flowers:**  The inflorescence is a spike-like cluster of unisexual flowers, with separate male and female flowers on the same plant (monoecious). The flowers are inconspicuous, lacking showy petals.\n* **Fruit:**  The plant produces small, brownish achenes (one-seeded fruits) enclosed in a sac-like structure called a perigynia.\n\n**Historic Usage:**\n\nWhile not as widely utilized as some other plants, *Carex stricta* has seen some historical and traditional uses:\n\n* **Weaving and Matting:**  Historically, the strong, fibrous leaves of stiff sedge were used by some indigenous North American peoples for weaving mats, baskets, and other similar items. The tough nature of the leaves made them suitable for durable crafts.\n* **Thatching:**  The leaves could also have been used for thatching roofs, providing a natural and relatively water-resistant covering.\n* **Erosion Control:**  The plant's natural tendency to form dense stands makes it a valuable species for erosion control along waterways and shorelines. This is a use that continues to this day in ecological restoration projects.\n\n\nIt's important to note that while *Carex stricta* has historical applications, it's not typically used for medicinal or culinary purposes. Its primary importance lies in its ecological role within wetland ecosystems and its potential for use in landscaping and conservation efforts.\n"
                },
                {
                    "name": "Carex cryptolepis",
                    "occurrences": 79,
                    "imgUrl": "http://data.huh.harvard.edu/9899a092-8f0b-40d1-8fc1-d72a17e4e165/image",
                    "description": "Carex cryptolepis, commonly known as **hidden-spike sedge**, is a species of sedge belonging to the Cyperaceae family.  It's a perennial herb, typically found in moist to wet habitats, often near streams, marshes, and other wetland areas.  Historically, its usage is not widely documented in the same way as some other sedges with more prominent applications.  Information regarding traditional medicinal or other uses is scarce in readily available sources; further research in ethnobotanical literature might reveal limited historical applications specific to certain indigenous cultures within its native range.\n\n**Basic Features:**\n\n* **Growth Habit:**  Carex cryptolepis grows in dense clumps or tussocks.  It typically spreads via rhizomes (underground stems) forming colonies.\n* **Leaves:**  The leaves are linear, relatively narrow, and typically light to medium green. They are often somewhat stiff and can be folded or rolled inwards.\n* **Flowers/Inflorescence:** The flowers are inconspicuous, typical of sedges, arranged in spikelets. These spikelets form a compound inflorescence.  The species name \"cryptolepis\" refers to the somewhat hidden or concealed nature of the spikelets within the overall inflorescence.\n* **Fruits/Seeds:** The plant produces small, dry fruits (achenes), which are dispersed, potentially through water or wind.\n* **Height:**  It generally reaches a height of between 30 to 70 cm (12 to 28 inches).\n* **Distribution:**  Its geographic distribution needs to be clarified using a detailed botanical source, as it varies depending on the subspecies or varieties.  However, it is typically found in parts of North America and possibly into other regions.\n\nIn summary, Carex cryptolepis is a relatively unassuming sedge with limited documented historical usage. Its key features lie in its wetland habitat preference, clonal growth habit, and relatively inconspicuous inflorescence.  More detailed ecological and potentially ethnobotanical research would be needed to fully detail its historical and cultural significance.\n"
                },
                {
                    "name": "Carex tenera",
                    "occurrences": 6,
                    "imgUrl": "http://data.huh.harvard.edu/cd0a9e99-4c66-41b2-ba65-16b852da1bbf/image",
                    "description": "Carex tenera, commonly known as the slender sedge or tender sedge, is a species of sedge belonging to the Cyperaceae family.  It's a perennial herbaceous plant, meaning it lives for more than two years and lacks a woody stem.\n\n**Basic Features:**\n\n* **Size and Habit:** Carex tenera is relatively small, typically growing to heights of 10-40 cm (4-16 inches). It forms dense, tufted clumps.\n* **Leaves:**  The leaves are linear, relatively narrow, and bright to greyish-green. They are typically shorter than the culms (stems).\n* **Flowers:**  Like other sedges, it produces inconspicuous flowers arranged in spikelets.  These spikelets are typically 1-3 cm long and are borne on slender stalks. The plant is monoecious, meaning both male and female flowers are present on the same plant, though usually separated on different parts of the inflorescence (flower cluster).\n* **Fruits:** The fruits are achenes (small, dry, one-seeded fruits).\n* **Habitat:**  Carex tenera thrives in moist to wet soils, often found in meadows, fens, stream banks, and wet woodland edges. It prefers acidic to neutral conditions.\n\n**Historic Usage:**\n\nWhile Carex tenera hasn't had widespread historical use like some other sedges (e.g., in mat-making), its ecological role has always been significant.  Indigenous peoples likely used it in various ways, though specific details are scarce in readily available literature.  Its primary historical usage, therefore, can be considered its role in wetland ecosystems, providing habitat and food for various insects and animals.  More research would be needed to explore its potential traditional uses by specific cultures.\n\n**In Summary:** Carex tenera is a small, unassuming sedge, vital to its wetland habitat but lacking a significant history of direct human utilization. Its understated beauty and ecological importance make it a noteworthy part of the plant world.\n"
                }
            ]
        },
        {
            "name": "Solidago",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Solidago nemoralis",
                    "occurrences": 99,
                    "imgUrl": "http://data.huh.harvard.edu/09b6436f-bb9b-462e-8f65-9d8414680c6c/image",
                    "description": "*Solidago nemoralis*, commonly known as Gray Goldenrod, is a perennial herbaceous plant belonging to the Asteraceae family (sunflowers and daisies).  It's native to North America, ranging widely from Canada to Mexico.\n\n**Basic Features:**\n\nGray Goldenrod is easily identified by its grayish-green, hairy leaves, which are lanceolate (lance-shaped) and often alternate along the stem.  Unlike some other goldenrods with tall, straight stems, *S. nemoralis* typically has multiple, somewhat sprawling stems that reach heights of 1 to 3 feet. Its flower heads are small and numerous, clustered in a loose, pyramidal arrangement at the top of the stems.  These flower heads are a light yellow color, contrasting with the grayish foliage.  The plant reproduces primarily through seeds.\n\n**Historic Usage:**\n\nHistorically, Native Americans utilized various parts of *Solidago nemoralis*, as they did with many other goldenrod species.  While specific documented uses for *S. nemoralis* are less abundant compared to some more prominent species, its usage likely overlapped with the general applications of other goldenrods within their respective regions.  These included:\n\n* **Medicinal purposes:**  Many goldenrods possess astringent and diuretic properties, and were used for treating wounds, urinary tract infections, and other ailments.  *S. nemoralis* likely shared some of these uses, although definitive historical accounts specific to this species may be limited.\n* **Dye:** Certain goldenrods were used to produce yellow dyes for fabrics, and it's plausible *S. nemoralis* was utilized similarly in some areas.\n\n\nIt's important to note that while many goldenrods have a history of medicinal use, scientific evidence supporting their efficacy for specific conditions is often lacking.  Any use for medicinal purposes should be under the guidance of a qualified healthcare professional.  Current use is primarily ornamental.\n"
                },
                {
                    "name": "Solidago gigantea",
                    "occurrences": 85,
                    "imgUrl": "http://data.huh.harvard.edu/0e47027a-728f-41b2-9d66-90aa1d54c663/image",
                    "description": "*Solidago gigantea*, commonly known as **giant goldenrod**, is a perennial herbaceous plant belonging to the Asteraceae (sunflower) family.  Native to eastern North America, it's found in a wide range of habitats, from moist meadows and ditches to roadsides and disturbed areas.  It's readily identifiable by its tall stature and abundant, late-summer flowering.\n\n**Basic Features:**\n\n* **Height:**  It can reach impressive heights, ranging from 3 to 10 feet (1-3 meters), hence the name \"giant\".\n* **Leaves:** The leaves are lanceolate (lance-shaped), with serrated edges, and usually lack hairs (glabrous or nearly so), a key differentiating feature from some other goldenrod species which are hairy. They are alternate along the stem.\n* **Flowers:** The numerous small, yellow flower heads are arranged in large, branching panicles (loose, branched clusters) at the top of the stem.  These flowers bloom from late summer into autumn, contributing significantly to pollinator resources at the end of the growing season.\n* **Stem:** The stem is generally smooth and sturdy, often reddish-tinged.\n\n**Historic Usage:**\n\nHistorically, *Solidago gigantea*, like other goldenrods, held significance for Native American tribes. While specific uses varied by tribe, common applications included:\n\n* **Medicinal:**  Infused teas and poultices were likely used to treat various ailments, potentially including wounds, fevers, and urinary tract infections.  However, specific documented historical uses are not as extensive as for some other *Solidago* species.  The medicinal properties remain largely unstudied scientifically in comparison to other, more researched species.\n* **Dye:**  The plant's parts may have been used to create yellow dyes for fabrics.\n\n\nIt's important to note that while traditional uses exist,  modern medicinal applications of *Solidago gigantea* are largely unexplored by scientific research.  Any use for medicinal purposes should be approached with caution and ideally under the guidance of a qualified healthcare professional.  Self-treating with wild plants can be dangerous.\n"
                },
                {
                    "name": "Solidago patula",
                    "occurrences": 4,
                    "imgUrl": "http://data.huh.harvard.edu/1446989a-8025-449b-8fae-1b762a43a67c/image",
                    "description": "*Solidago patula*, commonly known as **spreading goldenrod**, is a perennial herbaceous plant belonging to the Asteraceae family (the daisy family).  It's native to eastern North America, ranging from Canada south to Georgia and westward to the Great Plains.\n\n**Basic Features:**\n\n* **Growth Habit:** Spreading goldenrod is characterized by its sprawling, somewhat prostrate to ascending growth habit. It typically grows to heights of 1 to 3 feet (30-90 cm) tall and can spread laterally via rhizomes, forming colonies.\n* **Leaves:** Its leaves are lanceolate to oblong-lanceolate, typically 2-6 inches long, with serrated margins and a slightly hairy texture.  They are typically alternate along the stem.\n* **Flowers:**  The characteristic yellow, daisy-like flowers appear in late summer and fall (August-October). They are borne in paniculate arrays of small flower heads, giving the plant a generally showy, golden appearance.  Each flower head contains numerous small florets.\n* **Habitat:**  It thrives in moist to mesic conditions, often found in meadows, open woodlands, roadsides, and disturbed areas. It tolerates a range of soil types but prefers well-drained soil.\n\n\n**Historic Usage:**\n\nWhile not as extensively documented as some other *Solidago* species, *Solidago patula* likely shared similar traditional medicinal uses with its relatives.  Many goldenrods were historically used by Native American tribes and early European settlers for their purported medicinal properties.  These applications generally revolved around its reputed use as a:\n\n* **Diuretic:**  To increase urine production.\n* **Wound healer:** Applied topically to treat minor wounds and skin irritations.\n* **Anti-inflammatory:**  Though not scientifically validated in *S. patula* specifically, this is a common traditional use within the genus.\n\nIt's crucial to note that while historical uses exist, the efficacy and safety of these traditional medicinal applications for *Solidago patula* haven't been rigorously scientifically studied.  It's not recommended to self-treat with any plant-based remedies without professional medical advice.  Moreover, some individuals may experience allergic reactions to goldenrods.\n"
                }
            ]
        },
        {
            "name": "Symphyotrichum",
            "occurenceTotalGenus": 4,
            "subgenena": [
                {
                    "name": "Symphyotrichum ericoides",
                    "occurrences": 17,
                    "imgUrl": "http://data.huh.harvard.edu/350b79bd-705c-4004-9c64-f6724ca4c075/image",
                    "description": "Symphyotrichum ericoides, commonly known as white heath aster or heath aster, is a flowering perennial plant belonging to the Asteraceae family.  Native to eastern North America, it's found in a variety of habitats, from dry fields and open woods to rocky outcrops.\n\n**Basic Features:**\n\n* **Size and Habit:** It's a relatively small to medium-sized aster, typically growing 1 to 3 feet tall with a bushy, spreading habit.  Many slender, leafy stems branch from the base.\n* **Leaves:** Its leaves are small, numerous, linear to narrowly lanceolate, and closely spaced along the stems, giving it a heath-like appearance (hence the common name).  They are typically 1/2 to 1 inch long, and somewhat stiff and pointed.\n* **Flowers:**  The plant boasts numerous small, daisy-like flowers with white or pale lavender ray florets surrounding a yellow disc.  These flowers bloom in profusion in late summer and fall, often continuing until the first frost.\n* **Roots:** It possesses a fibrous root system.\n\n**Historic Usage:**\n\nWhile not as widely documented for medicinal uses as some other aster species,  Native American tribes likely incorporated *Symphyotrichum ericoides* into some traditional practices.  Specific uses are not well-documented, and more research is needed to clarify its historical ethnobotanical applications.  However, given the broad use of other asters for various ailments, it's plausible it may have been employed for similar purposes, possibly related to wound healing or respiratory issues, though this is purely speculative without further ethnobotanical study.   Its primary historical and current use is primarily ornamental, valued for its late-season blooms and ability to attract pollinators.\n\n\nIt's important to note that while traditionally used,  it's crucial to avoid self-medicating with wild plants. The exact constituents and their effects are not fully understood, and there's a risk of misidentification or adverse reactions.\n"
                },
                {
                    "name": "Symphyotrichum lateriflorum",
                    "occurrences": 100,
                    "imgUrl": "http://data.huh.harvard.edu/351825e3-e75c-4348-911f-371ab875e1d5/image",
                    "description": "*Symphyotrichum lateriflorum*, commonly known as calico aster, is a flowering herbaceous perennial plant in the aster family (Asteraceae).  Native to eastern North America, it's found in a variety of habitats, from moist meadows and woods to stream banks, exhibiting a wide tolerance for different soil conditions.  \n\n**Basic Features:** Calico aster is relatively low-growing, typically reaching heights of 1 to 3 feet. It's characterized by:\n\n* **Leaves:** Lance-shaped, alternately arranged leaves, often with serrated edges.  The leaves are generally smaller towards the top of the stem.\n* **Flowers:** Small, daisy-like flowers with white or light lavender ray florets surrounding a yellow disc. The flower heads are arranged in a somewhat one-sided, branching pattern along the stem, giving it its common name.  Flowering typically occurs in late summer and fall.\n* **Stem:**  The stems are slender and often have a somewhat spreading or sprawling habit.\n\n\n**Historic Usage:**  While not as prominent in historical records as some other aster species, *Symphyotrichum lateriflorum* likely held some medicinal value for Native American tribes.  Specific uses varied regionally, but it's plausible that parts of the plant were used for ailments similar to those treated with other aster species, potentially involving applications related to inflammation or wound healing.  However, detailed historical ethnobotanical records on this particular species are relatively limited compared to more commonly documented plants.  The primary historical use was likely as a component of broader native herbal remedies.  More research is needed to fully document its past applications.  Currently, its primary usage is ornamental, valued for its late-season blooms contributing to pollinator gardens and naturalized landscapes.\n"
                },
                {
                    "name": "Symphyotrichum novi-belgii",
                    "occurrences": 17,
                    "imgUrl": "http://data.huh.harvard.edu/359d5d71-3a75-498d-a112-56e8d097d0e5/image",
                    "description": "*Symphyotrichum novi-belgii*, commonly known as New York aster, is a species of flowering plant in the aster family (Asteraceae).  Native to eastern North America, it's a perennial herb that thrives in moist to wet soils, often found in meadows, along streams, and in other damp areas.\n\n**Basic Features:**\n\n* **Height:** Typically grows 1-3 feet tall, sometimes reaching 4 feet.\n* **Leaves:**  Lance-shaped to ovate leaves, generally alternate along the stem, with serrated margins.  They are usually smooth or slightly hairy.\n* **Flowers:**  Numerous small daisy-like flowers are clustered together in a flat-topped or slightly rounded inflorescence (flower head).  Ray florets (the outer petals) are typically light lavender, purple, pink, or white, while the disc florets (the central yellow part) mature to a brownish color.  Blooming occurs late summer to fall, making it a valuable source of nectar for pollinators late in the season.\n* **Stems:** Erect, often branching stems.\n\n**Historic Usage:**\n\nWhile not possessing a prominent history of widespread medicinal or culinary use like some other plants, *Symphyotrichum novi-belgii* has played a role in:\n\n* **Ornamental Use:**  Its late-season blooms and diversity in color have made it a popular ornamental plant in gardens for centuries. Many cultivars have been developed, offering a range of sizes, flower colors, and growth habits.\n* **Ecological Importance:**  As a native plant, it provides crucial habitat and food sources for various insects, including butterflies and bees, which are vital for maintaining ecosystem health.\n\nIt's important to note that while some traditional uses of asters have existed in various cultures, these are generally not scientifically validated and should not be undertaken without professional guidance.  The primary importance of *Symphyotrichum novi-belgii* today lies in its aesthetic and ecological value.\n"
                },
                {
                    "name": "Symphyotrichum puniceum",
                    "occurrences": 94,
                    "imgUrl": "http://data.huh.harvard.edu/421a1a65-c3b3-4b9c-815b-5d82a0c37703/image",
                    "description": "Symphyotrichum puniceum, commonly known as swamp aster or purple-stemmed aster, is a North American perennial herb belonging to the Asteraceae family (sunflowers and daisies).  It thrives in wet habitats such as marshes, swamps, ditches, and along the banks of streams and ponds, often growing in dense colonies.\n\n**Basic Features:**\n\n* **Height:**  Reaches heights of 1 to 3 feet (30-90 cm).\n* **Stems:**  Characteristically reddish-purple, often stout and branched.  This purplish coloration is a key identifying feature.\n* **Leaves:**  Lance-shaped to oblong, with serrated edges. Leaves are typically smooth or slightly hairy and are alternate along the stem. Lower leaves may be somewhat larger than those higher up the stem.\n* **Flowers:**  Numerous small, pinkish-purple to lavender daisy-like flowers clustered in a flat-topped or slightly rounded inflorescence (flower head). Each flower head contains numerous ray florets (the petals) surrounding a central disk of disc florets.  Blooms typically occur in late summer and autumn.\n\n**Historic Usage:**\n\nWhile not as widely documented as some other medicinal plants, Native Americans used various Aster species, including *Symphyotrichum puniceum*, for a range of purposes.  These uses were primarily medicinal and included:\n\n* **Wound healing:**  The plant's purported astringent properties were likely used to help staunch bleeding and promote wound healing.  This is a common use attributed to many plants in the Asteraceae family.\n* **Inflammatory conditions:**  Some traditional uses suggest its application for treating inflammatory conditions, though scientific evidence to support this is lacking.\n* **Other possible uses:**  Details regarding other potential uses are scarce and often interwoven with uses attributed to other Aster species.  Accurate separation of specific uses for *S. puniceum* from other asters is difficult due to limited historical documentation.\n\n\nIt's important to note that while *Symphyotrichum puniceum* has a history of traditional medicinal use, modern scientific research supporting these applications is limited.  **Any medicinal use should be approached with caution and under the guidance of qualified healthcare professionals.**  The plant should not be self-prescribed for medicinal purposes.  Instead, appreciate its beauty as a significant part of wetland ecosystems.\n"
                }
            ]
        }
    ]
}